       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIXED.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-NAME PIC X(10).
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-NAME.
           STOP RUN.
